[A_ArdentCaster_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狂热法师"
mTooltip="每施放一个火系法术，获得 %buff.buff.buff.buff.stat %buff.buff.buff.buff.stat.icon 力量。持续到战斗结束。"

[A_ArdentCaster_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_ArdentCaster_Buff_Might H7BaseBuff]
mName="狂热法师"
mTooltip=""

[A_FireMantle_Buff H7BaseBuff]
mName="火焰斗篷"
mTooltip="该生物近战攻击时造成额外 %d1.min 到 %d1.max %d1.icon 火焰伤害，被近战攻击时造成 %d2.min 到 %d2.max %d2.icon 火焰伤害。"

[A_FireScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烈火学者"
mTooltip="火系法术的法力消耗降低 %special.norm%。"

[A_FireWisdom_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烈火智慧"
mTooltip="火系法术获得 %stat1 魔力 %stat1.icon。其他每个智慧类能力都会增加 %stat1 魔力 %stat1.icon 到此加成中。"

[A_MasterOfFire_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火系学识I"
mTooltip="%spell1.name 额外对目标4x4区域内的生物造成 %spell1.spell.buff.buff.d.min 到 %spell1.spell.buff.buff.d.max %spell1.spell.buff.buff.d.icon 火焰伤害，持续 %spell1.spell.buff.buff.durini 回合。\n%spell2.name 现在对目标4x4区域内的生物施放。"

[A_MasterOfFire_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火系学识II"
mTooltip="%spell1.name 现在对目标4x4区域内的生物施放。\n%spell2.name 额外定身生物，并造成 %spell2.spell.buff3.buff.d.min 到 %spell2.spell.buff3.buff.d.max %ICON_FIRE 火焰伤害，持续 %spell2.spell.buff3.buff.durini 回合。"
  
v1.37

[A_FireMantle_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰斗篷"
mTooltip="友方生物近战攻击时造成额外 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 火焰伤害，并且被近战攻击时造成 %buff1.buff.d2.min 到 %buff1.buff.d2.max %buff1.buff.d2.icon 火焰伤害。\n如果英雄拥有所需知识，则有几率学会一个新的4级火系法术。"         

v1.39

[A_MasterOfFire_III_Ability H7HeroAbility]
mName="火系学识III"
mTooltip="%spell1.name 的目标生物现在优先攻击敌方生物，并以 %spell1.spell.buff1.buff.stat7 %ICON_ATTACK 攻击进行攻击。\n%spell2.name 额外在 %spell2.spell.buff1.buff.durini 回合内造成 %spell2.spell.buff1.buff.d.min 到 %spell2.spell.buff1.buff.d.max %spell2.spell.buff1.buff.d.icon 火焰伤害。\n%spell3 的目标单位获得一个减益效果，使其额外受到 %spell3.spell.buff1.buff.res %icon_fire 火焰伤害。\n%spell4.name 将目标生物的幸运降低至 %spell4.spell.buff2.buff.stat1 %icon_luck。" 

v1.41

[A_FireMagic_Skill H7Skill]
mName="火系魔法"
mTooltip="允许你在魔法行会学习火系魔法学派的法术。改善并增强其效果。"
mDescriptions[0]="使火系法术更有效，并提高英雄的 %ICON_ARCANE_KNOWLEDGE 魔力。"
mDescriptions[1]=""
mDescriptions[2]="使火系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力提高1点。\n英雄有几率学会一个新的1级火系法术。"
mDescriptions[3]="使火系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高2点。\n如果英雄拥有所需知识，则有几率学会一个新的2级火系法术。"
mDescriptions[4]="使火系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高3点。\n如果英雄拥有所需知识，则有几率学会一个新的3级火系法术。\n\n与大师级<font color="#00588BFF">进攻</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：燃烧之刃。"